<script>
	import api from './api/api.js'
	export default {
		globalData: {
			emoji: ['😀', '😁', '😂', '😃', '😄', '😅', '😆', '😉', '😊', '😋', '😎', '😍', '😘', '😗', '😙', '😚', '😇', '😐', '😑', '😶', '😏', '😣', '😥', '😮', '😯', '😪', '😫', '😴', '😌', '😛', '😜', '😝', '😒', '😓', '😔', '😕', '😲', '😷', '😖', '😞', '😟', '😤', '😢', '😭', '😦', '😧', '😨', '😬', '😰', '😱', '😳', '😵', '😠'],
			mine: {},
			friends: [],
			applyCount: 0,
			applys: [],
			chatting: {},
		}
	}
</script>

<style lang="less">
	@import url('./less/reset.less');
</style>